Repository: zend-modules/isocodes-language
Catalog: language/*.po
Languages: th, zh

source: Afar
th: อะฟาร์
zh: 阿法文

source: Abkhazian
th: อับคาซ
zh: 阿布哈西亚文

source: Achinese
th: อาเจะห์
zh: 亚齐文

source: Acoli
th: อาโคลิ
zh: 阿乔利文

source: Adangme
th: อาแดงมี
zh: 阿当梅文

source: Adyghe
th: อะดืยเก
zh: 阿迪何文

source: Afro-Asiatic Language
th: ภาษาแอฟโร-เอเชียติก
zh: 其他亚非语系

source: Afrihili
th: แอฟริฮีลี
zh: 阿弗里希利文

source: Afrikaans
th: แอฟริกานส์
zh: 南非荷兰文

source: Ainu
th: ไอนุ
zh: 阿伊努文

source: Akan
th: อาคัน
zh: 阿肯文

source: Akkadian
th: อักกาด
zh: 阿卡德文

source: Albanian
th: แอลเบเนีย
zh: 阿尔巴尼亚文

source: Aleut
th: อาลิวต์
zh: 阿留申文

source: Algonquian Language
th: ภาษาอัลกองเควียน
zh: 其他阿尔贡语系

source: Southern Altai
th: อัลไตใต้
zh: 南阿尔泰文

source: Amharic
th: อัมฮารา
zh: 阿姆哈拉文

source: Old English
th: อังกฤษโบราณ
zh: 古英文

source: Angika
th: อังคิกา
zh: 昂加文

source: Apache Language
th: ภาษาอาปาเช่
zh: 阿帕切文

source: Arabic
th: อาหรับ
zh: 阿拉伯文

source: Aramaic
th: อราเมอิก
zh: 阿拉米文

source: Aragonese
th: อารากอน
zh: 阿拉贡文

source: Armenian
th: อาร์เมเนีย
zh: 亚美尼亚文

source: Mapuche
th: อาเราคาเนียน
zh: 阿劳坎文

source: Arapaho
th: อาราปาโฮ
zh: 阿拉帕霍文

source: Artificial Language
th: ภาษาประดิษฐ์
zh: 其他人工语系

source: Arawak
th: อาราวัก
zh: 阿拉瓦克文

source: Assamese
th: อัสสัม
zh: 阿萨姆文

source: Asturian
th: อัสตูเรียส
zh: 阿斯图里亚思特文

source: Athapascan Language
th: ภาษาอาทาพาสกาน
zh: 阿萨帕斯坎语系

source: Australian Language
th: ภาษาออสเตรเลีย
zh: 澳大利亚语系

source: Avaric
th: อาวาร์
zh: 阿瓦尔文

source: Avestan
th: อเวสตะ
zh: 阿维斯塔文

source: Awadhi
th: อวธี
zh: 阿瓦乔文

source: Aymara
th: ไอย์มารา
zh: 艾马拉文

source: Azerbaijani
th: อาเซอร์ไบจาน
zh: 阿塞拜疆文

source: Banda
th: บันดา
zh: 班达文

source: Bamileke Language
th: ภาษาบามีเลก์
zh: 巴米累克语系

source: Bashkir
th: บัชคีร์
zh: 巴什客尔文

source: Baluchi
th: บาลูชิ
zh: 俾路支文

source: Bambara
th: บัมบารา
zh: 班巴拉文

source: Balinese
th: บาหลี
zh: 巴里文

source: Basque
th: บัสเก
zh: 巴斯克文

source: Basaa
th: บาสา
zh: 巴萨文

source: Baltic Language
th: ภาษาบอลติก
zh: 其他波罗的语系

source: Beja
th: เบจา
zh: 别札文

source: Belarusian
th: เบลารุส
zh: 白俄罗斯文

source: Bemba
th: เบมบา
zh: 别姆巴文

source: Bengali
th: เบงกาลี
zh: 孟加拉文

source: Berber
th: เบอร์เบอร์
zh: 柏柏尔文

source: Bhojpuri
th: โภชปุรี
zh: 博杰普尔文

source: Bihari
th: พิหาร
zh: 比哈尔文

source: Bikol
th: บิกอล
zh: 毕库尔文

source: Bini
th: บินี
zh: 比尼文

source: Bislama
th: บิสลามา
zh: 比斯拉马文

source: Siksika
th: สิกสิกา
zh: 司克司卡文

source: Bantu
th: บันตู
zh: 班图文

source: Bosnian
th: บอสเนีย
zh: 波斯尼亚文

source: Braj
th: พัรช
zh: 布拉杰文

source: Breton
th: เบรตัน
zh: 布里多尼文

source: Batak
th: บาตัก
zh: 巴塔克文

source: Buriat
th: บูเรียต
zh: 布里亚特文

source: Buginese
th: บูกิส
zh: 布吉文

source: Bulgarian
th: บัลแกเรีย
zh: 保加利亚文

source: Burmese
th: พม่า
zh: 缅甸文

source: Blin
th: บลิน
zh: 布林文

source: Caddo
th: คัดโด
zh: 卡多文

source: Central American Indian Language
th: ภาษาอเมริกันอินเดียนกลาง
zh: 其他中美印第安语系

source: Carib
th: คาริบ
zh: 巴勒比文

source: Catalan
th: กาตาลัง
zh: 加泰罗尼亚文

source: Caucasian Language
th: ภาษาคอเคเซียน
zh: 其他高加索语系

source: Cebuano
th: เซบู
zh: 宿务文

source: Celtic Language
th: ภาษาเซลติก
zh: 其他凯尔特语系

source: Chamorro
th: ชามอร์โร
zh: 查莫罗文

source: Chibcha
th: ชิบชา
zh: 契布卡文

source: Chechen
th: เชเชน
zh: 车臣文

source: Chagatai
th: ชะกะไต
zh: 查加文

source: Chinese
th: จีน
zh: 中文

source: Chuukese
th: ชูก
zh: 楚吾克文

source: Mari
th: มารี
zh: 马里文

source: Chinook Jargon
th: ชินุกจาร์กอน
zh: 契努克文

source: Choctaw
th: ช็อกทอว์
zh: 乔克托文

source: Chipewyan
th: ชิพิวยัน
zh: 佩瓦扬文

source: Cherokee
th: เชอโรกี
zh: 彻罗基文

source: Church Slavic
th: เชอร์ชสลาวิก
zh: 宗教斯拉夫文

source: Chuvash
th: ชูวัช
zh: 楚瓦什文

source: Cheyenne
th: เชเยนเน
zh: 夏延文

source: Chamic Language
th: ภาษาชามิก
zh: 查米克文

source: Coptic
th: คอปติก
zh: 科普特文

source: Cornish
th: คอร์นิช
zh: 凯尔特文

source: Corsican
th: คอร์ซิกา
zh: 科西嘉文

source: English-based Creole or Pidgin
th: ครีโอลหรือพิดจิ้นที่มาจากภาษาอังกฤษ
zh: 其他以英文为基础的克里奥尔混合语系

source: French-based Creole or Pidgin
th: ครีโอลหรือพิดจิ้นที่มาจากภาษาฝรั่งเศส
zh: 其他以法文为基础的克里奥尔混合语系

source: Portuguese-based Creole or Pidgin
th: ครีโอลหรือพิดจิ้นที่มาจากภาษาโปรตุเกส
zh: 其他以葡萄牙文为基础的克里奥尔混合语系

source: Cree
th: ครี
zh: 克里族文

source: Crimean Turkish
th: ตุรกีไครเมีย
zh: 克里米亚土耳其文

source: Creole or Pidgin
th: ครีโอลหรือพิดจิ้น
zh: 其他克里奥尔混合语系

source: Kashubian
th: คาซูเบียน
zh: 卡舒文

source: Cushitic Language
th: ภาษาคูชิทิก
zh: 其他库施特语系

source: Czech
th: เช็ก
zh: 捷克文

source: Dakota
th: ดาโกทา
zh: 达科他文

source: Danish
th: เดนมาร์ก
zh: 丹麦文

source: Dargwa
th: ดาร์กิน
zh: 达尔格瓦文

source: Dayak
th: ดายัก
zh: 达雅克文

source: Delaware
th: เดลาแวร์
zh: 特拉华文

source: Slave
th: สเลวี
zh: 司雷夫文

source: Dogrib
th: โดกริบ
zh: 多格里布文

source: Dinka
th: ดิงกา
zh: 丁卡文

source: Divehi
th: ธิเวหิ
zh: 迪维希文

source: Dogri
th: โฑครี
zh: 多格拉文

source: Dravidian Language
th: ภาษาดราวิเดียน
zh: 其他德拉维语系

source: Lower Sorbian
th: ซอร์บส์ตอนล่าง
zh: 下索布文

source: Duala
th: ดัวลา
zh: 都阿拉文

source: Middle Dutch
th: ดัตช์กลาง
zh: 中古荷兰文

source: Dutch
th: ดัตช์
zh: 荷兰文

source: Dyula
th: ดิวลา
zh: 迪尤拉文

source: Dzongkha
th: ซองคา
zh: 不丹文

source: Efik
th: อีฟิก
zh: 埃菲克文

source: Ancient Egyptian
th: อียิปต์โบราณ
zh: 古埃及文

source: Ekajuk
th: อีกาจุก
zh: 埃克丘克文

source: Elamite
th: อีลาไมต์
zh: 艾拉米特文

source: English
th: อังกฤษ
zh: 英文

source: Middle English
th: อังกฤษกลาง
zh: 中古英文

source: Esperanto
th: เอสเปอรันโต
zh: 世界文

source: Estonian
th: เอสโตเนีย
zh: 爱沙尼亚文

source: Ewe
th: เอเว
zh: 埃维文

source: Ewondo
th: อีวันโด
zh: 旺杜文

source: Fang
th: ฟอง
zh: 芳格文

source: Faroese
th: แฟโร
zh: 法罗文

source: Fanti
th: ฟันติ
zh: 芳蒂文

source: Fijian
th: ฟิจิ
zh: 斐济文

source: Filipino
th: ฟิลิปปินส์
zh: 菲律宾文

source: Finnish
th: ฟินแลนด์
zh: 芬兰文

source: Finno-Ugrian Language
th: ภาษาฟินโน-อูกริก
zh: 其他芬兰乌戈尔语系

source: French
th: ฝรั่งเศส
zh: 法文

source: Middle French
th: ฝรั่งเศสกลาง
zh: 中古法文

source: Old French
th: ฝรั่งเศสโบราณ
zh: 古法文

source: Northern Frisian
th: ฟริเซียนเหนือ
zh: 北弗里西亚文

source: Eastern Frisian
th: ฟริเซียนตะวันออก
zh: 东弗里西亚文

source: Western Frisian
th: ฟริเซียนตะวันตก
zh: 西弗里西亚文

source: Fulah
th: ฟูลาฮ์
zh: 夫拉文

source: Friulian
th: ฟรูลี
zh: 弗留利文

source: Ga
th: กา
zh: 加文

source: Gayo
th: กาโย
zh: 迦约文

source: Gbaya
th: กบายา
zh: 葛巴亚文

source: Germanic Language
th: ภาษาเจอร์เมนิก
zh: 其他日尔曼语系

source: Georgian
th: จอร์เจีย
zh: 格鲁吉亚文

source: German
th: เยอรมัน
zh: 德文

source: Geez
th: กีซ
zh: 吉兹文

source: Gilbertese
th: กิลเบอร์ต
zh: 吉尔伯特斯文

source: Scottish Gaelic
th: สกอตส์กาลิก
zh: 苏格兰盖尔文

source: Irish
th: ไอริช
zh: 爱尔兰文

source: Galician
th: กาลิเซีย
zh: 加利西亚文

source: Manx
th: มานซ์
zh: 马恩岛文

source: Middle High German
th: เยอรมันสูงกลาง
zh: 中古高地德文

source: Old High German
th: เยอรมันสูงโบราณ
zh: 古高地德文

source: Gondi
th: กอนดิ
zh: 岗德文

source: Gorontalo
th: กอรอนทาโล
zh: 科洛涅达罗文

source: Gothic
th: โกธิก
zh: 哥特文

source: Grebo
th: เกรโบ
zh: 格列博文

source: Ancient Greek
th: กรีกโบราณ
zh: 古希腊文

source: Greek
th: กรีก
zh: 希腊文

source: Guarani
th: กวารานี
zh: 瓜拉尼文

source: Swiss German
th: เยอรมันสวิส
zh: 瑞士德文

source: Gujarati
th: คุชราต
zh: 古吉拉特文

source: Gwichʼin
th: กวิชอิน
zh: 吉维克琴文

source: Haida
th: ไฮดา
zh: 海达文

source: Haitian
th: เฮติ
zh: 海地文

source: Hausa
th: เฮาชา
zh: 豪萨文

source: Hawaiian
th: ฮาวาย
zh: 夏威夷文

source: Hebrew
th: ฮิบรู
zh: 希伯来文

source: Herero
th: เฮเรโร
zh: 赫雷罗文

source: Hiligaynon
th: ฮีลีกัยนน
zh: 希利盖农文

source: Himachali
th: หิมาจัล
zh: 赫马查利文

source: Hindi
th: ฮินดี
zh: 印地文

source: Hittite
th: ฮิตไตต์
zh: 赫梯文

source: Hmong
th: ม้ง
zh: 赫蒙文

source: Hiri Motu
th: ฮีรีโมตู
zh: 希里莫图文

source: Croatian
th: โครเอเชีย
zh: 克罗地亚文

source: Upper Sorbian
th: ซอร์บส์ตอนบน
zh: 上索布文

source: Hungarian
th: ฮังการี
zh: 匈牙利文

source: Hupa
th: ฮูปา
zh: 胡帕文

source: Iban
th: อิบาน
zh: 伊班文

source: Igbo
th: อิกโบ
zh: 伊布文

source: Icelandic
th: ไอซ์แลนด์
zh: 冰岛文

source: Ido
th: อีโด
zh: 伊多文

source: Sichuan Yi
th: เสฉวนยิ
zh: 四川彝文

source: Inuktitut
th: อินุกติตุต
zh: 伊努伊特文

source: Interlingue
th: อินเตอร์ลิงกิว
zh: 国际文字（E）

source: Iloko
th: อีโลโก
zh: 伊洛干诺文

source: Interlingua
th: อินเตอร์ลิงกัว
zh: 国际文字

source: Indic Language
th: ภาษาอินดิก
zh: 其他印度语系

source: Indonesian
th: อินโดนีเชีย
zh: 印度尼西亚文

source: Indo-European Language
th: ภาษาอินโด-ยุโรป
zh: 其他印欧语系

source: Ingush
th: อินกุช
zh: 印古什文

source: Inupiaq
th: อีนูเปียก
zh: 依奴皮维克文

source: Iranian Language
th: ภาษาอิหร่าน
zh: 伊朗文

source: Iroquoian Language
th: ภาษาอีโรกัวส์
zh: 伊洛魁语系

source: Italian
th: อิตาลี
zh: 意大利文

source: Javanese
th: ชวา
zh: 爪哇文

source: Lojban
th: โลชบัน
zh: 逻辑文

source: Japanese
th: ญี่ปุ่น
zh: 日文

source: Judeo-Persian
th: ยิว-เปอร์เซีย
zh: 犹太波斯文

source: Judeo-Arabic
th: ยิว-อาหรับ
zh: 犹太阿拉伯文

source: Kara-Kalpak
th: การา-กาลพาก
zh: 卡拉卡尔帕克文

source: Kabyle
th: กาไบล
zh: 卡比尔文

source: Kachin
th: กะฉิ่น
zh: 卡琴文

source: Kalaallisut
th: กรีนแลนด์
zh: 格陵兰文

source: Kamba
th: คัมบา
zh: 卡姆巴文

source: Kannada
th: กันนาดา
zh: 卡纳达文

source: Karen
th: กะเหรี่ยง
zh: 喀伦文

source: Kashmiri
th: กัศมีร์
zh: 克什米尔文

source: Kanuri
th: คานูรี
zh: 卡努里文

source: Kawi
th: กวี
zh: 卡威文

source: Kazakh
th: คาซัค
zh: 哈萨克文

source: Kabardian
th: คาร์บาเดีย
zh: 卡巴尔达文

source: Khasi
th: กาสี
zh: 卡西文

source: Khoisan Language
th: ภาษาคอยซาน
zh: 其他科伊桑语系

source: Khmer
th: เขมร
zh: 高棉文

source: Khotanese
th: โคตัน
zh: 和田文

source: Kikuyu
th: กีกูยู
zh: 吉库尤文

source: Kinyarwanda
th: รวันดา
zh: 卢旺达文

source: Kirghiz
th: คีร์กีซ
zh: 吉尔吉斯文

source: Kimbundu
th: คิมบุนดู
zh: 金邦杜文

source: Konkani
th: กอนกานี
zh: 刚卡尼文

source: Komi
th: โกมิ
zh: 科米文

source: Kongo
th: คองโก
zh: 刚果文

source: Korean
th: เกาหลี
zh: 韩文

source: Kosraean
th: คูสไร
zh: 科斯拉伊文

source: Kpelle
th: กาแปล
zh: 克佩列文

source: Karachay-Balkar
th: คาราไช-บัลคาร์
zh: 卡拉恰伊巴尔卡尔文

source: Karelian
th: แกรเลียน
zh: 卡累利阿文

source: Kru
th: ครู
zh: 克鲁文

source: Kurukh
th: กุรุข
zh: 库鲁克文

source: Kuanyama
th: กวนยามา
zh: 宽亚玛文

source: Kumyk
th: คูมืยค์
zh: 库梅克文

source: Kurdish
th: เคิร์ด
zh: 库尔德文

source: Kutenai
th: คูเทไน
zh: 库特内文

source: Ladino
th: ลาดิโน
zh: 拉迪诺文

source: Lahnda
th: ลาฮ์นดา
zh: 拉亨达文

source: Lamba
th: แลมบา
zh: 兰巴文

source: Lao
th: ลาว
zh: 老挝文

source: Latin
th: ละติน
zh: 拉丁文

source: Latvian
th: ลัตเวีย
zh: 拉脱维亚文

source: Lezghian
th: เลซเกียน
zh: 莱兹依昂文

source: Limburgish
th: ลิมเบิร์ก
zh: 淋布尔吉文

source: Lingala
th: ลิงกาลา
zh: 林加拉文

source: Lithuanian
th: ลิทัวเนีย
zh: 立陶宛文

source: Mongo
th: มองโก
zh: 芒戈文

source: Lozi
th: โลซิ
zh: 洛兹文

source: Luxembourgish
th: ลักเซมเบิร์ก
zh: 卢森堡文

source: Luba-Lulua
th: ลูบา-ลูลัว
zh: 鲁巴鲁瓦文

source: Luba-Katanga
th: ลูบา-กาตองกา
zh: 鲁巴加丹加文

source: Ganda
th: ยูกันดา
zh: 卢干达文

source: Luiseno
th: ลุยเซโน
zh: 路易塞诺文

source: Lunda
th: ลันดา
zh: 隆达文

source: Mizo
th: ลูไช
zh: 卢晒文

source: Macedonian
th: มาซิโดเนีย
zh: 马其顿文

source: Madurese
th: มาดูรา
zh: 马都拉文

source: Magahi
th: มคหี
zh: 马加伊文

source: Marshallese
th: มาร์แชลลิส
zh: 马绍尔文

source: Maithili
th: ไมถิลี
zh: 迈蒂利文

source: Makasar
th: มากาซาร์
zh: 望加锡文

source: Malayalam
th: มาลายาลัม
zh: 马拉雅拉姆文

source: Mandingo
th: มันดิงกา
zh: 曼丁哥文

source: Maori
th: เมารี
zh: 毛利文

source: Austronesian Language
th: ออสโตรนีเซียน
zh: 澳斯特罗尼西亚语系

source: Marathi
th: มราฐี
zh: 马拉地文

source: Masai
th: มาไซ
zh: 萨伊文

source: Malay
th: มาเลย์
zh: 马来文

source: Moksha
th: มอคชา
zh: 莫克沙文

source: Mandar
th: มานดาร์
zh: 曼达尔文

source: Mende
th: เมนเด
zh: 门迪文

source: Middle Irish
th: ไอริชกลาง
zh: 中古爱尔兰文

source: Micmac
th: มิกแมก
zh: 米克马克文

source: Minangkabau
th: มีนังกาเบา
zh: 米南卡保文

source: Miscellaneous Language
th: ภาษาอื่นๆ
zh: 各种不同语系

source: Mon-Khmer Language
th: ภาษามอญ-เขมร
zh: 其他孟高棉语系

source: Malagasy
th: มาลากาซี
zh: 马尔加什文

source: Maltese
th: มอลตา
zh: 马耳他文

source: Manchu
th: แมนจู
zh: 满文

source: Manipuri
th: มณีปุระ
zh: 曼尼普里文

source: Manobo Language
th: ภาษามาโนโบ
zh: 马诺博语系

source: Mohawk
th: โมฮอว์ก
zh: 摩霍克文

source: Mongolian
th: มองโกเลีย
zh: 蒙古文

source: Mossi
th: โมซี
zh: 莫西文

source: Multiple Languages
th: หลายภาษา
zh: 多种语系

source: Munda Language
th: ภาษามันดา
zh: 蒙达语系

source: Creek
th: ครีก
zh: 克里克文

source: Mirandese
th: มีรันดา
zh: 米兰德斯文

source: Marwari
th: มารวาฑี
zh: 马尔瓦利文

source: Mayan Language
th: ภาษามายา
zh: 玛雅语系

source: Erzya
th: เอียร์ซยา
zh: 俄日亚文

source: Nahuatl
th: นาฮัว
zh: 纳瓦特尔文

source: North American Indian Language
th: ภาษาอินเดียอเมริกาเหนือ
zh: 其他北美印第安语系

source: Neapolitan
th: นาโปลี
zh: 拿波里文

source: Nauru
th: นาอูรู
zh: 瑙鲁文

source: Navajo
th: นาวาโฮ
zh: 纳瓦霍文

source: South Ndebele
th: เอ็นเดเบเลใต้
zh: 南恩德贝勒文

source: North Ndebele
th: เอ็นเดเบเลเหนือ
zh: 北恩德贝勒文

source: Ndonga
th: ดองกา
zh: 恩东加文

source: Low German
th: เยอรมันต่ำ - แซกซอนต่ำ
zh: 低地德文

source: Nepali
th: เนปาล
zh: 尼泊尔文

source: Newari
th: เนวาร์
zh: 尼瓦尔文

source: Nias
th: นีอัส
zh: 尼亚斯文

source: Niger-Kordofanian Language
th: ภาษาไนเจอร์-คอร์โดฟาเนียน
zh: 其他尼日尔科尔多凡语系

source: Niuean
th: นีอู
zh: 纽埃文

source: Norwegian Nynorsk
th: นอร์เวย์นีนอสก์
zh: 挪威尼诺斯克文

source: Norwegian Bokmål
th: นอร์เวย์บุคมอล
zh: 挪威博克马尔文

source: Nogai
th: โนไก
zh: 诺盖文

source: Old Norse
th: นอร์สโบราณ
zh: 古诺尔斯文

source: Norwegian
th: นอร์เวย์
zh: 挪威文

source: N’Ko
th: เอ็นโก
zh: 西非书面文字

source: Northern Sotho
th: โซโทเหนือ
zh: 北索托文

source: Nubian Language
th: ภาษานูเบียน
zh: 努比亚语系

source: Classical Newari
th: เนวาร์ดั้งเดิม
zh: 经典尼瓦尔文

source: Nyanja
th: เนียนจา
zh: 尼扬扎文

source: Nyamwezi
th: เนียมเวซี
zh: 尼亚姆韦齐文

source: Nyankole
th: เนียนโกเล
zh: 尼昂科勒文

source: Nyoro
th: นิโอโร
zh: 尼约罗文

source: Nzima
th: นซิมา
zh: 恩济马文

source: Occitan
th: อ็อกซิตัน
zh: 奥克西唐文

source: Ojibwa
th: โอจิบวา
zh: 奥吉布瓦文

source: Oriya
th: โอริยา
zh: 欧里亚文

source: Oromo
th: โอโรโม
zh: 奥洛莫文

source: Osage
th: โอซากี
zh: 奥萨格文

source: Ossetic
th: ออสเซเตีย
zh: 奥塞梯文

source: Ottoman Turkish
th: ตุรกีออตโตมัน
zh: 奥托曼土耳其文

source: Otomian Language
th: ภาษาโอโตมี
zh: 奥托米语系

source: Papuan Language
th: ภาษาปาปัว
zh: 其他巴布亚文

source: Pangasinan
th: ปางาซีนัน
zh: 邦阿西楠文

source: Pahlavi
th: ปะห์ลาวี
zh: 帕拉维文

source: Pampanga
th: ปัมปางา
zh: 邦板牙文

source: Punjabi
th: ปัญจาบ
zh: 旁遮普文

source: Papiamento
th: ปาเปียเมนโต
zh: 帕皮亚门托文

source: Palauan
th: ปาเลา
zh: 帕劳文

source: Old Persian
th: เปอร์เซียโบราณ
zh: 古老波斯文

source: Persian
th: เปอร์เซีย
zh: 波斯文

source: Philippine Language
th: ภาษาฟิลิปปิน
zh: 其他菲律宾语系

source: Phoenician
th: ฟินิเชีย
zh: 腓尼基文

source: Pali
th: บาลี
zh: 巴利文

source: Polish
th: โปแลนด์
zh: 波兰文

source: Pohnpeian
th: พอห์นเพ
zh: 波纳佩文

source: Portuguese
th: โปรตุเกส
zh: 葡萄牙文

source: Prakrit Language
th: ภาษาปรากฤต
zh: 普拉克里特诸语言

source: Old Provençal
th: โปรวองซาลโบราณ
zh: 普罗文斯文

source: Pashto
th: พาชตู
zh: 普什图文

source: Quechua
th: ควิชัว
zh: 盖丘亚文

source: Rajasthani
th: ราชสถาน
zh: 拉贾斯坦文

source: Rapanui
th: ราปานู
zh: 拉帕努伊文

source: Rarotongan
th: ราโรทองกา
zh: 拉罗汤加文

source: Romance Language
th: ภาษาโรมานซ์
zh: 其他拉丁语系

source: Romansh
th: โรแมนซ์
zh: 罗曼什文

source: Romany
th: โรมานี
zh: 吉普赛文

source: Romanian
th: โรมาเนีย
zh: 罗马尼亚文

source: Rundi
th: บุรุนดี
zh: 基隆迪文

source: Aromanian
th: อาโรมาเนียน
zh: 阿罗马尼亚文

source: Russian
th: รัสเซีย
zh: 俄文

source: Sandawe
th: ซันดาเว
zh: 散达维文

source: Sango
th: แซงโก
zh: 桑戈文

source: Sakha
th: ซาฮา
zh: 雅库特文

source: South American Indian Language
th: ภาษาอเมริกันอินเดียนใต้
zh: 其他南美印第安文

source: Salishan Language
th: ภาษาชาลิช
zh: 萨利什文

source: Samaritan Aramaic
th: อราเมอิกซามาเรีย
zh: 萨玛利亚文

source: Sanskrit
th: สันสกฤต
zh: 梵文

source: Sasak
th: ซาซัก
zh: 萨萨克文

source: Santali
th: สันตาลี
zh: 桑塔利文

source: Sicilian
th: ซิซิลี
zh: 西西里文

source: Scots
th: สกอตส์
zh: 苏格兰文

source: Selkup
th: เซลคุป
zh: 塞尔库普文

source: Semitic Language
th: ภาษาเซมิติก
zh: 其他闪族语系

source: Old Irish
th: ไอริชโบราณ
zh: 古爱尔兰文

source: Sign Language
th: ภาษาสัญญาณ
zh: 手语

source: Shan
th: ไทใหญ่
zh: 掸文

source: Sidamo
th: ซิดาโม
zh: 悉达摩文

source: Sinhala
th: สิงหล
zh: 僧伽罗文

source: Siouan Language
th: ภาษาซิอวน
zh: 苏语诸语言

source: Sino-Tibetan Language
th: ภาษาซิโน-ทิเบต
zh: 其他汉藏语系

source: Slavic Language
th: ภาษาสลาวิก
zh: 其他斯拉夫语系

source: Slovak
th: สโลวัก
zh: 斯洛伐克文

source: Slovenian
th: สโลวีเนีย
zh: 斯洛文尼亚文

source: Southern Sami
th: ซามิใต้
zh: 南萨米文

source: Northern Sami
th: ซามิเหนือ
zh: 北萨米文

source: Sami Language
th: ภาษาซามิ
zh: 其他萨米文

source: Lule Sami
th: ซามิลูเล
zh: 律勒欧萨莫斯文

source: Inari Sami
th: ซามิอีนารี
zh: 伊纳里萨米文

source: Samoan
th: ซามัว
zh: 萨摩亚文

source: Skolt Sami
th: ซามิสคอลต์
zh: 斯科特萨米文

source: Shona
th: โชนา
zh: 绍纳文

source: Sindhi
th: สินธุ
zh: 信德文

source: Soninke
th: โซนีนเก
zh: 索尼基文

source: Sogdien
th: ซอกดีน
zh: 古粟特文

source: Somali
th: โซมาลี
zh: 索马里文

source: Songhai
th: ซองไฮ
zh: 桑海文

source: Southern Sotho
th: โซโทใต้
zh: 南索托文

source: Spanish
th: สเปน
zh: 西班牙文

source: Sardinian
th: ซาร์เดญา
zh: 萨丁文

source: Sranan Tongo
th: ซูรินาเม
zh: 苏里南汤加文

source: Serbian
th: เซอร์เบีย
zh: 塞尔维亚文

source: Serer
th: เซแรร์
zh: 谢列尔文

source: Nilo-Saharan Language
th: ภาษานิโล-ซาฮารัน
zh: 非洲撒哈拉沙漠边缘地带语言

source: Swati
th: สวาติ
zh: 斯瓦特文

source: Sukuma
th: ซูคูมา
zh: 苏库马文

source: Sundanese
th: ซุนดา
zh: 巽他文

source: Susu
th: ซูซู
zh: 苏苏文

source: Sumerian
th: ซูเมอ
zh: 苏马文

source: Swahili
th: สวาฮีลี
zh: 斯瓦希里文

source: Swedish
th: สวีเดน
zh: 瑞典文

source: Classical Syriac
th: ซีเรียแบบดั้งเดิม
zh: 经典叙利亚文

source: Syriac
th: ซีเรีย
zh: 叙利亚文

source: Tahitian
th: ตาฮิตี
zh: 塔西提文

source: Tai Language
th: ภาษาไท
zh: 傣语诸语言

source: Tamil
th: ทมิฬ
zh: 泰米尔文

source: Tatar
th: ตาตาร์
zh: 塔塔尔文

source: Telugu
th: เตลูกู
zh: 泰卢固文

source: Timne
th: ทิมเน
zh: 滕内文

source: Tereno
th: เทเรโน
zh: 特列纳文

source: Tetum
th: เตตุม
zh: 特塔姆文

source: Tajik
th: ทาจิก
zh: 塔吉克文

source: Tagalog
th: ตากาล็อก
zh: 塔加洛文

source: Thai
th: ไทย
zh: 泰文

source: Tibetan
th: ทิเบต
zh: 藏文

source: Tigre
th: ตีเกร
zh: 提格雷文

source: Tigrinya
th: ติกริญญา
zh: 提格里尼亚文

source: Tokelau
th: โตเกเลา
zh: 托克劳文

source: Klingon
th: คลิงกอน
zh: 克林贡文

source: Tlingit
th: ทลิงกิต
zh: 特林吉特文

source: Tamashek
th: ทามาเชก
zh: 塔马奇克文

source: Nyasa Tonga
th: ไนอะซาตองกา
zh: 汤加文（尼亚萨地区）

source: Tongan
th: ตองกา
zh: 汤加文

source: Tok Pisin
th: ท็อกพิซิน
zh: 托克皮辛文

source: Tsimshian
th: ซิมชีแอน
zh: 蒂姆西亚文

source: Tswana
th: บอตสวานา
zh: 塞茨瓦纳文

source: Tsonga
th: ซิิตซองกา
zh: 宗加文

source: Turkmen
th: เติร์กเมนิสถาน
zh: 土库曼文

source: Tumbuka
th: ทุมบูกา
zh: 通布卡文

source: Tupi Language
th: ภาษาตูปี
zh: 图皮语系

source: Turkish
th: ตุรกี
zh: 土耳其文

source: Altaic Language
th: ภาษาอัลตาอิก
zh: 阿尔泰诸语言

source: Tuvalu
th: ตูวาลู
zh: 图瓦卢文

source: Twi
th: ทวิ
zh: 特威文

source: Tuvinian
th: ตูวา
zh: 图瓦文

source: Udmurt
th: อุดมูร์ต
zh: 乌德穆尔特文

source: Ugaritic
th: ยูการิต
zh: 乌加里特文

source: Uighur
th: อุยกัว
zh: 维吾尔文

source: Ukrainian
th: ยูเครน
zh: 乌克兰文

source: Umbundu
th: อุมบุนดู
zh: 翁本杜文

source: Unknown Language
th: ไม่มีข้อมูล
zh: 未知语言

source: Urdu
th: อูรดู
zh: 乌尔都文

source: Uzbek
th: อุซเบก
zh: 乌兹别克文

source: Venda
th: เวนดา
zh: 文达文

source: Vietnamese
th: เวียดนาม
zh: 越南文

source: Volapük
th: โวลาพึค
zh: 沃拉普克文

source: Votic
th: โวทิก
zh: 沃提克文

source: Wakashan Language
th: ภาษาวากาชาน
zh: 瓦卡什诸语言

source: Wolaytta
th: วาลาโม
zh: 瓦拉莫文

source: Waray
th: วาเรย์
zh: 瓦赖文

source: Washo
th: วาโช
zh: 瓦绍文

source: Welsh
th: เวลส์
zh: 威尔士文

source: Sorbian Language
th: ภาษาซอร์บส์
zh: 索布诸语言

source: Walloon
th: วาโลนี
zh: 瓦隆文

source: Wolof
th: โวลอฟ
zh: 沃洛夫文

source: Kalmyk
th: คัลมืยค์
zh: 卡尔梅克文

source: Xhosa
th: คะห์โอซา
zh: 科萨文

source: Yapese
th: ยัป
zh: 雅浦文

source: Yiddish
th: ยิว
zh: 依地文

source: Yoruba
th: โยรูบา
zh: 约鲁巴文

source: Yupik Language
th: ภาษาอูย์ปิค
zh: 尤皮克诸语言

source: Zapotec
th: ซาโปเตก
zh: 萨波蒂克文

source: Blissymbols
th: บลิสซิมโบลส์
zh: 布利斯符号

source: Zenaga
th: เซนากา
zh: 泽纳加文

source: Zhuang
th: จ้วง
zh: 壮文

source: Zande
th: ซันเด
zh: 赞德文

source: Zulu
th: ซูลู
zh: 祖鲁文

source: Zuni
th: ซูนิ
zh: 祖尼文

source: No linguistic content
th: ไม่มีข้อมูลภาษา
zh: 无语言内容

source: Zaza
th: ซาซา
zh: 扎扎文
